In [1]:
import pandas as pd
import numpy as np

# changing options with attributes dot syntax

In [20]:
data=np.random.randint(0,100,[30,5])

In [18]:
data

array([[61, 68, 67, 76,  1],
       [38, 87, 57, 19, 29],
       [35, 89, 79, 57, 75],
       [61, 92, 45,  2, 30],
       [93, 90, 16, 59, 34],
       [51, 23, 26, 20, 90],
       [81, 52,  2, 21, 72],
       [66, 29, 24, 91,  0],
       [23, 84, 92, 46, 56],
       [52, 54, 92, 85, 46],
       [74, 49, 49, 49, 23],
       [43, 19, 17, 23, 16],
       [ 9, 23,  8,  9, 77],
       [24, 52, 85, 63, 48],
       [ 2, 55,  5, 28, 78],
       [89,  7, 69, 18,  5],
       [11, 58, 87, 32, 25],
       [93, 46, 90, 62,  9],
       [10, 29,  3, 77, 39],
       [19, 72, 48, 25, 78],
       [44, 58, 35,  0, 49]])

In [21]:
df=pd.DataFrame(data)

In [16]:
df.head()

    0   1   2   3   4
0  61  68  67  76   1
1  38  87  57  19  29
2  35  89  79  57  75
3  61  92  45   2  30
4  93  90  16  59  34

In [11]:
pd.options.display.max_rows

60

In [12]:
pd.options.display.max_columns

20

In [31]:
df

     0   1   2   3   4
0   52  77  91   0  55
1   37  13  39  61  32
2   18  62  86  26  77
3   89  62   0  57  28
4   53  39  73  58  40
..  ..  ..  ..  ..  ..
25  13  44  26  78  33
26  72  19  30  37  69
27  15  79  56  62  22
28  11  19  44  80  93
29  56  12   4  10  43

[30 rows x 5 columns]

In [34]:
pd.options.display.max_rows=6

In [35]:
df

     0   1   2   3   4
0   52  77  91   0  55
1   37  13  39  61  32
2   18  62  86  26  77
..  ..  ..  ..  ..  ..
27  15  79  56  62  22
28  11  19  44  80  93
29  56  12   4  10  43

[30 rows x 5 columns]

In [36]:
pd.options.display.max_columns=2

In [ ]:
df

In [38]:
df

     0  ...   4
0   52  ...  55
1   37  ...  32
2   18  ...  77
..  ..  ...  ..
27  15  ...  22
28  11  ...  93
29  56  ...  43

[30 rows x 5 columns]

# changing options with methods

In [41]:
data=np.random.randint(0,100,[30,5])
df=pd.DataFrame(data)
df

     0  ...   4
0    7  ...  87
1   64  ...  61
2   92  ...  23
..  ..  ...  ..
27  52  ...  57
28  26  ...  19
29   4  ...  22

[30 rows x 5 columns]

In [40]:
pd.get_option("max_rows")

6

In [42]:
pd.get_option("max_columns")

2

In [49]:
pd.set_option("max_columns",4)

In [50]:
df

     0   1  ...   3   4
0    7  60  ...   6  87
1   64  17  ...  63  61
2   92  75  ...  96  23
..  ..  ..  ...  ..  ..
27  52  33  ...  15  57
28  26  99  ...  26  19
29   4  37  ...  99  22

[30 rows x 5 columns]

In [51]:
pd.set_option("max_rows",6)

In [52]:
df

     0   1  ...   3   4
0    7  60  ...   6  87
1   64  17  ...  63  61
2   92  75  ...  96  23
..  ..  ..  ...  ..  ..
27  52  33  ...  15  57
28  26  99  ...  26  19
29   4  37  ...  99  22

[30 rows x 5 columns]

In [54]:
pd.options.display.max_columns

4

In [56]:
pd.reset_option("max_columns")

In [57]:
pd.get_option("max_columns")

20

In [58]:
pd.reset_option("max_rows")

In [60]:
pd.get_option("max_rows")

60

In [61]:
pd.describe_option("max_columns")

display.max_columns : int
    If max_cols is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the width of the terminal and print a truncated object which fits
    the screen width. The IPython notebook, IPython qtconsole, or IDLE
    do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 20] [currently: 20]

# The precesion optiopns

In [64]:
df=pd.DataFrame(np.random.randn(5,5))#neg 2 and 2

In [65]:
df

          0         1         2         3         4
0  0.131664 -0.338884  0.498925 -0.519237  1.034446
1 -0.878093 -0.915612 -0.749196  1.425273  0.532406
2 -1.129818  0.432261 -0.597357  0.085933  0.400826
3 -0.275017 -0.682231 -0.076080 -0.163329  2.114398
4 -1.501590  0.543023 -1.624644 -0.251730 -1.373461

In [66]:
pd.get_option("precision")

6

In [67]:
pd.set_option("precision",2)

In [68]:
df

      0     1     2     3     4
0  0.13 -0.34  0.50 -0.52  1.03
1 -0.88 -0.92 -0.75  1.43  0.53
2 -1.13  0.43 -0.60  0.09  0.40
3 -0.28 -0.68 -0.08 -0.16  2.11
4 -1.50  0.54 -1.62 -0.25 -1.37